
#### Terraform Plan 📖
* **Proyecto (Workspace):** `test-project-7`
* **Fichero de definición:** `project-definitions/otrademo.tfvars`
```terraform
Acquiring state lock. This may take a few moments...
module.project_factory.module.project-factory.random_id.random_project_id_suffix: Refreshing state... [id=Lrk]
module.project_factory.module.project-factory.google_project.main: Refreshing state... [id=projects/test-project-7-2eb9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_binding.project_iam["roles/owner"] will be created
  + resource "google_project_iam_binding" "project_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "user:raul.makendengue@devoteam.com",
        ]
      + project = "test-project-7-2eb9"
      + role    = "roles/owner"
    }

  # google_project_organization_policy.project_policies["compute.trustedImageProjects"] will be created
  + resource "google_project_organization_policy" "project_policies" {
      + constraint  = "compute.trustedImageProjects"
      + etag        = (known after apply)
      + id          = (known after apply)
      + project     = "test-project-7-2eb9"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all = true
            }
        }
    }

  # module.project_factory.module.project-factory.google_project.main is tainted, so must be replaced
-/+ resource "google_project" "main" {
      ~ id                  = "projects/test-project-7-2eb9" -> (known after apply)
        name                = "test-project-7"
      ~ number              = "44866983581" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.project_factory.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = "test-project-7-2eb9"
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_factory.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "test-project-7 Project Service Account"
      + email                        = "project-service-account@test-project-7-2eb9.iam.gserviceaccount.com"
      + id                           = (known after apply)
      + member                       = "serviceAccount:project-service-account@test-project-7-2eb9.iam.gserviceaccount.com"
      + name                         = (known after apply)
      + project                      = "test-project-7-2eb9"
      + unique_id                    = (known after apply)
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "test-project-7-2eb9"
      + service                    = "compute.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "test-project-7-2eb9"
      + service                    = "serviceusage.googleapis.com"
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + project_id                      = "test-project-7-2eb9"
  + project_number                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
**Acción Requerida:** Un revisor debe [aprobar el despliegue](https://github.com/demo-project-factory/tech-talk-demo/actions/runs/18950510132) para continuar con el `apply`.
